sdaiTestAttrBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Determines if the value of attribute is unset.
\param instance      [in] An instance of the entity that contains the attribute to be checked.
\param attributeName [in] A string that contains the name of the attribute.
\returns sdaiTRUE if the attribute's value is set; otherwise the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiInstance instanceRecord27 = ...;
...
SdaiBoolean boolRes = sdaiTestAttrBN(instanceRecord27, "UnitType");